{"inkVersion":20,"root":[[{"#":"name Jel"},{"#":"sprite neutral"},{"#":"bg think"},{"->":"Begin"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Begin":["^It is a stormy night and you are a tired investigator in space.","\n","^Not really the best place, but certainly not the worst.","\n","^You're in one of the few agencies that allow free passage to fancy parties.","\n","^Heck, you might even get to have some cake this time assuming you are not betten by the werewolves.","\n","^....That would sound weird in some other dimension that does not have myths come to life.","\n","^Luckily, you are in such a world and nobody could be watching your inner thoughts.","\n","^Speaking of thoughts, how are you feeling about this up coming party?","\n",{"->":"Feelings"},{"#f":1}],"Feelings":[["ev","str","^Up to the challenge! It'll be a hell of a time!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Things like this always make me tense...","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Don't really want to go, but I have a friend that wants to.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"Excited"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Nervous"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Eh"},"\n",{"#f":5}]}],{"#f":1}],"Excited":[["^Life is a party!","\n","^Why not acutally enjoy life in that way since you earned it?","\n","^Besides, you know it will be even better with your buddy cop to spice things even more up.","\n","^Even if you were not thinking about it though, you cannot refuse a request from your friend imp...","\n","ev","str","^Next","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"ImpIntro"},"\n",{"#f":5}]}],{"#f":1}],"Nervous":[["^Work did always leave you on edge when just being out and about.","\n","^Space is no joke with its underbelly for any species alike.","\n","^However, even you knew that you would have to wind down and your partner in crime knew just as well.","\n","ev","str","^Next","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"ImpIntro"},"\n",{"#f":5}]}],{"#f":1}],"Eh":[["^It was hard to bring yourself to care about this party as a whole.","\n","^Investigating brought you away from people for the most part (if you exclude the crowds).","\n","^Part of the benefit with the job you have found.","\n","^However, your partnered investigator was of a different mind unfortunately.","\n","^You could not turn him down however as he was...","\n","ev","str","^Next","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"ImpIntro"},"\n",{"#f":5}]}],{"#f":1}],"ImpIntro":[["^Isaac the Inquisimp, your buddy cop for over a year now.","\n","^An oddball that is as easily excitable as he is scared.","\n","^Which is to say he is the sun and moon at the same time.","\n","^The little dude has always been a big help where it counted though, no matter the emotional state.","\n","^Which is why you're going to be attending the event with him. After putting down four cases back to back, both of you decided that it is time for a break.","\n","ev","str","^Next","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"ImpChat"},"\n",{"#f":5}]}],{"#f":1}],"ImpChat":[[{"#":"name Isaac"},{"#":"sprite neutral"},{"#":"bg hall"},"^\"Jel! Come on, we're going to be late, my friend! Hurry, Hurry!\"","\n","^He is figuratively bouncing off the walls as we walk through the hall. It is hard not to get sweeped up in his excitement.","\n","ev","str","^Foreshadowing","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"Shadow"},"\n",{"#f":5}]}],{"#f":1}],"Shadow":[{"#":"name Jel"},{"#":"sprite sad"},{"#":"bg hall"},"^However, we would soon find that this night and party might not be what it seems.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}